function checkProbabilityTheory(count) {
  let evenCount = 0; // змінна в якій ми будесо зберігати к-ть парних чисел
  let oddCount = 0; // змінна в якій ми будесо зберігати к-ть непарних чисел

  for (let i = 0; i < count; i++) {
    // робимо цикл, щоб генерувати необхіну  кількість разів (у нашому випадку count) випадкове число
    let randomNumber = Math.floor(Math.random() * (1000 - 100 + 1)) + 100;
    /*функція Math.random() генерує будь яке число від 0 до 1,
      aле у нашому випадку нам необхідне число від 100 до 1000, відповідно добавляємо умову Math.random() * (1000 - 100 + 1), тобто визначаємо діапазон,
      це буде 1000-100=900, також необхілно добавити 1 щоб діапазон був від 100 до 1000 включно і цей діапазон має 901 можливих значень (цілих)
            приклад: рандомне число 0,7897879. ми його множимо на 901 = 711,5988979,
            алк оскільуи нам потрібно ціле число, то використовуємо функцію Math.floor яка просто відкидує всі числа після коми тобто округлює до меншого
            ми отримали 711, але це число у діапазон від 0 до 900, а нам потрібно від 100 до 1000, то просто додаємо 100 до нашоно числа*/

    if (randomNumber % 2 === 0) {
      /* у рядку 7 ми зхенерували якесь число, тепер перевіряємо чи воно парне чи не парне використовуючи операор % 2, 
       який ділить число на 2 у нашому випадку та визначаємо чи є нас залишок від ділення чи ні, тобто поділивши 811 на 2, отримуємо 405,1
       тобто залишок 5 і це не дорівняє 0 отдже додається 1 до змінної oddCount*/
      evenCount++;
    } else {
      oddCount++;
    }
  }

  let percentage = Math.round((evenCount / count) * 100); // Підрахунок відсотків парних чисел до не парних округлюючи до нійбільшого цілого числа

  console.log(`кількість чисел: ${count}`);
  console.log(`кількість парних чисел: ${evenCount}`);
  console.log(`кількість не парних чисел: ${oddCount}`);
  console.log(`відсоток парних до не парних: ${percentage}%`);
}

checkProbabilityTheory(100);
